; domain
(define (domain liftedtcore_minigrid-domain)
 (:requirements :strips :typing :negative-preconditions :disjunctive-preconditions :equality :conditional-effects :existential-preconditions :universal-preconditions :action-costs)
 (:types
    room objectordoor color - object
    object_ door - objectordoor
    empty_0 ball box - object_
 )
 (:constants
   blue_ball_1 purple_ball_1 - ball
   empty - empty_0
   blue_door_1 purple_door_1 - door
   room_1 - room
 )
 (:predicates (agentinroom ?room - room) (objectinroom ?obj - object_ ?room - room) (objectcolor ?objectordoor - objectordoor ?color - color) (at_ ?objectordoor - objectordoor) (carrying ?obj - object_) (locked ?door - door) (adjacentrooms ?room1 - room ?room2 - room ?door - door) (blocked ?door - door ?obj - object_ ?room - room) (visited ?room - room) (emptyhands) (hold_0) (hold_1) (hold_2) (seen_psi_3) (hold_4) (hold_5) (hold_6))
 (:functions (total-cost))
 (:action gotoobject
  :parameters ( ?obj - object_ ?room - room)
  :precondition (and (objectinroom ?obj ?room) (agentinroom ?room))
  :effect (and(forall (?o - object_) (when (at_ ?o) (not (at_ ?o))))(forall (?d - door) (when (at_ ?d) (not (at_ ?d)))) (at_ ?obj) (when (carrying purple_ball_1) (hold_4)) (increase (total-cost) 1)))
 (:action gotoempty
  :parameters ()
  :effect (and(forall (?o - object_) (when (at_ ?o) (not (at_ ?o))))(forall (?d - door) (when (at_ ?d) (not (at_ ?d)))) (at_ empty) (when (carrying purple_ball_1) (hold_4)) (increase (total-cost) 1)))
 (:action gotodoor
  :parameters ( ?door - door ?room1 - room ?room2 - room)
  :precondition (and (adjacentrooms ?room1 ?room2 ?door) (agentinroom ?room1) (forall (?o - object_)
 (not (blocked ?door ?o ?room1))))
  :effect (and(forall (?o - object_) (when (at_ ?o) (not (at_ ?o))))(forall (?d - door) (when (at_ ?d) (not (at_ ?d)))) (at_ ?door) (when (or (= ?door purple_door_1) (carrying purple_ball_1)) (hold_4)) (increase (total-cost) 1)))
 (:action gotoroom
  :parameters ( ?room1 - room ?room2 - room ?door - door)
  :precondition (and (agentinroom ?room1) (adjacentrooms ?room1 ?room2 ?door) (not (locked ?door)))
  :effect (and (not (agentinroom ?room1)) (agentinroom ?room2) (visited ?room2)(forall (?o - object_) (when (at_ ?o) (not (at_ ?o))))(forall (?d - door) (when (at_ ?d) (not (at_ ?d)))) (when (or (= ?room2 room_1) (and (agentinroom room_1) (not (= ?room1 room_1)))) (seen_psi_3)) (when (carrying purple_ball_1) (hold_4)) (increase (total-cost) 1)))
 (:action pick
  :parameters ( ?obj - object_ ?room - room)
  :precondition (and (agentinroom ?room) (objectinroom ?obj ?room) (at_ ?obj) (emptyhands))
  :effect (and (not (at_ ?obj)) (not (emptyhands)) (carrying ?obj) (not (objectinroom ?obj ?room))(forall (?d - door) (when (blocked ?d ?obj ?room) (not (blocked ?d ?obj ?room)))) (hold_1) (when (or (at_ purple_door_1) (= ?obj purple_ball_1) (carrying purple_ball_1)) (hold_4)) (when (and (objectinroom blue_ball_1 room_1) (not (and (= ?obj blue_ball_1) (= ?room room_1)))) (hold_5)) (hold_6) (increase (total-cost) 1)))
 (:action drop
  :parameters ( ?obj - object_ ?room - room)
  :precondition (and (agentinroom ?room) (carrying ?obj) (not (emptyhands)) (at_ empty))
  :effect (and (not (carrying ?obj)) (at_ ?obj) (not (at_ empty)) (emptyhands) (objectinroom ?obj ?room) (when (locked blue_door_1) (not (hold_1))) (when (or (at_ purple_door_1) (and (carrying purple_ball_1) (not (= ?obj purple_ball_1)))) (hold_4)) (when (or (and (= ?obj blue_ball_1) (= ?room room_1)) (objectinroom blue_ball_1 room_1)) (hold_5)) (increase (total-cost) 1)))
 (:action toggle
  :parameters ( ?door - door)
  :precondition (and (at_ ?door) (or (and (not (locked ?door)) (= ?door blue_door_1)) (and (locked blue_door_1) (not (and (locked ?door) (= ?door blue_door_1)))) (seen_psi_3)))
  :effect (and (when (not (locked ?door)) (locked ?door)) (when (locked ?door) (not (locked ?door))) (when (or (and (not (locked ?door)) (= ?door blue_door_1)) (and (locked blue_door_1) (not (and (locked ?door) (= ?door blue_door_1))))) (hold_0)) (when (and (or (and (not (locked ?door)) (= ?door blue_door_1)) (and (locked blue_door_1) (not (and (locked ?door) (= ?door blue_door_1))))) (emptyhands)) (not (hold_1))) (when (not (or (and (not (locked ?door)) (= ?door blue_door_1)) (and (locked blue_door_1) (not (and (locked ?door) (= ?door blue_door_1)))))) (hold_2)) (increase (total-cost) 1)))
)

; problem
(define (problem liftedtcore_minigrid-problem)
 (:domain liftedtcore_minigrid-domain)
 (:objects
   room_1 room_2 room_3 room_4 - room
   redtype greentype bluetype yellowtype purpletype greytype - color
   red_door_1 yellow_door_1 green_door_1 - door
   red_box_1 green_box_1 - box
   blue_ball_1 yellow_ball_1 green_ball_1 red_ball_1 purple_ball_2 - ball
 )
 (:init (agentinroom room_3) (objectinroom yellow_ball_1 room_1) (objectinroom green_box_1 room_1) (objectinroom red_ball_1 room_1) (objectinroom green_ball_1 room_1) (objectinroom blue_ball_1 room_2) (objectinroom red_box_1 room_2) (objectinroom purple_ball_1 room_2) (objectinroom purple_ball_2 room_4) (objectcolor yellow_ball_1 yellowtype) (objectcolor green_box_1 greentype) (objectcolor red_ball_1 redtype) (objectcolor green_ball_1 greentype) (objectcolor blue_ball_1 bluetype) (objectcolor red_box_1 redtype) (objectcolor purple_ball_1 purpletype) (objectcolor purple_ball_2 purpletype) (objectcolor red_door_1 redtype) (objectcolor yellow_door_1 yellowtype) (objectcolor blue_door_1 bluetype) (objectcolor green_door_1 greentype) (emptyhands) (locked red_door_1) (locked yellow_door_1) (locked blue_door_1) (locked green_door_1) (adjacentrooms room_2 room_1 red_door_1) (adjacentrooms room_1 room_2 red_door_1) (adjacentrooms room_3 room_1 yellow_door_1) (adjacentrooms room_1 room_3 yellow_door_1) (adjacentrooms room_4 room_2 blue_door_1) (adjacentrooms room_2 room_4 blue_door_1) (adjacentrooms room_4 room_3 green_door_1) (adjacentrooms room_3 room_4 green_door_1) (visited room_3) (= (total-cost) 0))
 (:goal (and (exists (?v - ball)
 (and (objectcolor ?v greentype) (objectinroom ?v room_1) (agentinroom room_1) (at_ ?v))) (hold_0)))
 (:metric minimize (total-cost))
)

; plan
1. (gotodoor yellow_door_1 room_3 room_1)
   added: (at_ yellow_door_1)
   goals met: 0 of 2
2. (toggle yellow_door_1)
   deleted: (locked yellow_door_1)
   added: (hold_0)
   goals met: 1 of 2
3. (gotoroom room_3 room_1 yellow_door_1)
   deleted: (agentinroom room_3) (at_ yellow_door_1)
   added: (agentinroom room_1) (visited room_1) (seen_psi_3)
   goals met: 1 of 2
4. (gotodoor red_door_1 room_1 room_2)
   added: (at_ red_door_1)
   goals met: 1 of 2
5. (toggle red_door_1)
   deleted: (locked red_door_1)
   goals met: 1 of 2
6. (gotoroom room_1 room_2 red_door_1)
   deleted: (agentinroom room_1) (at_ red_door_1)
   added: (agentinroom room_2) (visited room_2)
   goals met: 1 of 2
7. (gotoobject purple_ball_1 room_2)
   added: (at_ purple_ball_1)
   goals met: 1 of 2
8. (pick purple_ball_1 room_2)
   deleted: (at_ purple_ball_1) (emptyhands) (objectinroom purple_ball_1 room_2)
   added: (carrying purple_ball_1) (hold_1) (hold_4) (hold_6)
   goals met: 1 of 2
9. (gotoroom room_2 room_1 red_door_1)
   deleted: (agentinroom room_2)
   added: (agentinroom room_1)
   goals met: 1 of 2
10. (gotoobject green_ball_1 room_1)
   added: (at_ green_ball_1)
   goals met: 2 of 2
